{"__v":10,"_id":"nuby_express:action_static_folder","author":"bingomanatee","content":"An action's static folder is a folder that contains one or more folder of static resources and a static folder configuration file, `config.json`. \nThough a static folder may *appear* to resemble a classic \"public\" folder of static resources, in reality each of the folders it contains are prefixed in http by their own path, defined in the config.json file.\n\nThere is no relationship between the URLs in an action's [[action_config:Configuration File]] -- though you can create one if you wish. \n\nAlso, resources in an action's static folder are *not* automatically linked by the HTML in the client side view; you still have to manually insert `link`, `img` or `script` tags that call for your static resources or use the [[layout_component:Layout Component]] and configuration references to add specific client side resources into the context\n\nLastly, any files you publish from a static file can be found and referenced globally; they are not restricted to your action, __or protected by any layer of security__.\n\n## Static Folder Configuration\n\nthe `config.json` file is a map of one or more folder names, to the URL that each folder should respond to. For instance: \n\n``` json\n{\n\"map\": \n   {\n      \"js\": \"/js/gallery\",\n      \"css\": \"/css/gallery\"\n   }\n}\n```\n\nIn this way, the contents of the script folder can appear to be distributed in several other folders if you wish; or, you can make it appear that a single static folder (`/js`) contains files that are in reality scattered throughout many different actions. \n\n# Example\n\nSay you have an image gallery action that displays a list of thumbnails for your images in a grid. You need a magnifying glass image to appear on hover state for the image icons, and CSS specific to the gallery grid. \n\nHere is a file listing of the static folder: \n\n``` files\nactions\n  gallery\n    static\n      js\n        backbone_controller.js\n      img\n        magnify.png\n        next.png\n        prev.png\n      css\n        gallery.css\n      config.json\n  action.js\n  view.html\n  config.json\n```\n\nThe config.json file in the __static__ directory is as follows:\n\n``` json\n{\n  \"map\": {\n    \"js\": \"/js/gallery\".\n    \"css\": \"/css/gallery\".\n    \"img\": \"/images/gallery\"\n  }\n}\n```\nHere is a the HTML file that links to the above files: \n\n``` html\n<html>\n<head>\n<link type=\"text.css\" href=\"/css/gallery/gallery.css\" />\n<script language=\"javascript\" src=\"/js/gallery/backbone_controller.js\"></script>\n</head>\n<body>\n<h1>Image Gallery</h1>\n<article>\n....\n</article>\n<a href=\"/next\"><img src=\"/images/gallery/next.png\" /></a>\n</body>\n</html>\n```","creator":"bingomanatee","name":"action_static_folder","scope":"nuby_express","summary":"The static resources that an action requires","title":"Action's Static Folder","write_date":"2012-10-26T01:03:52.455Z","scope_root":false,"deleted":false}