{"__v":5,"_id":"nuby_express:why","author":"bingomanatee","content":"It is easy to think that there are so many players in the MVC Framework space, expecially Express which is the current standard for Node apps, that there is really no call for yet another candidate. \n\nThere are several reasons for creating a generalized application like this. \n\n1. While there are a lot of enterprise class frameworks and CMS systems - Drupal, Zend Framework, Django, Symfony -- in the generalized web development sphere, there is only one offering in Node: Express, and it fills the role of a low-level engine like Sinatra extremely well. Unfortunately it is a module driven and functional system, and doesn't leverage the kind of file based configuration pattern established by Ruby, and in my mind that limits its ability to serve as a foundation for a large enterprise scale system. \n2. I feel most MVC apps are wrongly oriented towards orienting the organizational matrix around file types, which segregates the static files that a given action away from the code that drives the action, both on the server and client side of the equation. The fundamental unit of organization in Nuby Express is the action, and all the resources that a given action are directly contained in the action folder itself, or quite often, one or two levels up. This makes editing a given action much easier as your attention is focused directly on the activity you are trying to edit.\n3. Most of the Node developers I know are fiercely independent and protective of the structure of their application; towards that end I wanted to ensure that the structure that digests the folders that configure an application was mutable so that developers can define their own style of application, and organize their files however they like, as long as they understand the code that digests folders and files. the [[layout_component:Layout component]] is a case study in the ability of a custom module to re-scan the file structure for custom resources that it needs to re-engineer the entire application at the core. \n4. There are currently no \"showcase applications\" along the lines of SugarCRM, to prove that Node is ready for the demands of the modern world, and I strongly feel that before such applications are created, fundamental development of an application framework is needed so these applications are easily maintainable and extendable.\n5. I have been personally dissatisfied with the leading tools, Ruby and Drupal, for rapid application development, and I believe that Nuby-Express addressed the priorities of modern application developers -- testability, single-page development, and REST based applications -- better than the current industry standards.","creator":"bingomanatee","linked_from":[],"name":"why","scope":"nuby_express","summary":"Why I created Nuby-Express","title":"Why I created Nuby Express","write_date":"2012-10-23T14:56:23.727Z","scope_root":false,"deleted":false}